# IFCImport Options Link Position Property

Source: https://www.revitapidocs.com/2026/e1eee09c-2f35-e140-beb8-8f367fd336f5.htm

---

| IFCImport Options Link Position Property |
| --- |

The position of the Linked IFC File in the Host Document.
**Namespace:** Autodesk.Revit.DB.IFC
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IFCLinkPosition LinkPosition { get; set; }
```

```
Public Property LinkPosition As IFCLinkPosition
	Get
	Set
```

```
public:
property IFCLinkPosition LinkPosition {
	IFCLinkPosition get ();
	void set (IFCLinkPosition value);
}
```

```
member LinkPosition : IFCLinkPosition with get, set
```

#### Property Value

IFCLinkPosition Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCImportOptions Class Autodesk.Revit.DB.IFC Namespace